lamtranBKHN/AGV_V3.0/STM32_RTOS/AGV_3.0_WATCHDOG_Step/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define motor_left_dir_Pin GPIO_PIN_0
#define motor_left_dir_GPIO_Port GPIOC
#define motor_left_step_Pin GPIO_PIN_1
#define motor_left_step_GPIO_Port GPIOC
#define motor_right_dir_Pin GPIO_PIN_2
#define motor_right_dir_GPIO_Port GPIOC
#define motor_right_step_Pin GPIO_PIN_3
#define motor_right_step_GPIO_Port GPIOC
#define adc_battery_pin_Pin GPIO_PIN_1
#define adc_battery_pin_GPIO_Port GPIOA
#define running_led_Pin GPIO_PIN_6
#define running_led_GPIO_Port GPIOA
#define planning_led_Pin GPIO_PIN_7
#define planning_led_GPIO_Port GPIOA
#define servo_pin_Pin GPIO_PIN_14
#define servo_pin_GPIO_Port GPIOB
#define proximity_sensor_Pin GPIO_PIN_15
#define proximity_sensor_GPIO_Port GPIOB
#define buzzer_Pin GPIO_PIN_12
#define buzzer_GPIO_Port GPIOC
#define display_scl_Pin GPIO_PIN_6
#define display_scl_GPIO_Port GPIOB
#define display_sda_Pin GPIO_PIN_7
#define display_sda_GPIO_Port GPIOB
#define sonar_trig_Pin GPIO_PIN_8
#define sonar_trig_GPIO_Port GPIOB
#define sonar_echo_Pin GPIO_PIN_9
#define sonar_echo_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
